rails/app/views/visitors/index.html.erb

SELECT COUNT(*) FROM `users`
SELECT COUNT(*) FROM `services`
---
<h3>Welcome</h3>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
<p><%= link_to 'Services:', services_path %> <%= Service.count %> registered</p>