rails/app/views/welcome/index.html.erb

<p><%= link_to 'Go to Admin Dashboard', admin_access_path %></p>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
<p><%= link_to 'Services:', services_path %> <%= Service.count %> registered</p>
---
SELECT COUNT(*) FROM `users`
SELECT COUNT(*) FROM `services`