rails/app/views/service_admins/_form.html.erb

    <td>
      <%= f.collection_select(:service_id, Service.all, :id, :name ) %>
---
SELECT `services`.* FROM `services`