rails/app/controllers/admins_controller.rb

SELECT  `admins`.* FROM `admins`  WHERE `admins`.`id` = 1 LIMIT 1
SELECT `services`.* FROM `services`
SELECT `admins`.* FROM `admins`
SELECT `service_admins`.* FROM `service_admins`
---
	def home
		@admin = Admin.find(session[:id])
		@services = Service.all
		@service_admins = ServiceAdmin.all

SELECT  `admins`.* FROM `admins`  WHERE `admins`.`username` = 'gohar'  ORDER BY `admins`.`id` ASC LIMIT 1
---
	def login
		if params[:username].present? && params[:password].present?
			found_user = Admin.where(:username => params[:username]).first

SELECT  `admins`.* FROM `admins`  WHERE `admins`.`id` = 1 LIMIT 1
---
	def show
		@admin = Admin.find(params[:id])

INSERT INTO `admins` (`created_at`, `password_digest`, `updated_at`, `username`) VALUES ('2015-04-04 09:41:54', '$2a$10$a0YnfkSNzNW3r8BkV7pVfeLGladaaAV4DYWMm1My4U86d1trPtEu.', '2015-04-04 09:41:54', 'dev')
---
	def create
		# passwords from the input form must match
		if params[:admin][:password] != params[:admin][:password_confirm]
			flash[:notice] = "Passwords don't match!"
			redirect_to(:action => 'new')
			return
		end

		@admin = Admin.new(admin_params)
		if @admin.save

SELECT  `admins`.* FROM `admins`  WHERE `admins`.`id` = 1 LIMIT 1
UPDATE `admins` SET `password_digest` = '$2a$10$KjnaFO.Q38lUI0iYVqEr1u7MdmgVAX5zTNCKWoTKBikNzA3H0/3Lq', `updated_at` = '2015-04-04 10:00:32' WHERE `admins`.`id` = 1
---
	def update
		@admin = Admin.find(params[:id])
		if @admin.update_attributes(admin_params)

SELECT  `admins`.* FROM `admins`  WHERE `admins`.`id` = 1 LIMIT 1
---
	def edit
		@admin = Admin.find(params[:id])

DELETE FROM `admins` WHERE `admins`.`id` = 2
SELECT  `admins`.* FROM `admins`  WHERE `admins`.`id` = 2 LIMIT 1
---
	def destroy
		@admin = Admin.find(params[:id]).destroy