rails/app/controllers/admin_access_controller.rb

SELECT  `admins`.* FROM `admins`  WHERE `admins`.`username` = 'gohar'  ORDER BY `admins`.`id` ASC LIMIT 1
SELECT  `service_admins`.* FROM `service_admins`  WHERE `service_admins`.`username` = 'gohar'  ORDER BY `service_admins`.`id` ASC LIMIT 1
---
	def login
		if params[:username].present? && params[:password].present?
			found_user = Admin.where(:username => params[:username]).first
			if found_user
				authorized_user = found_user.authenticate(params[:password])
				user_type = "admin"
			end
			if !found_user
				found_user = ServiceAdmin.where(:username => params[:username]).first