rails/app/controllers/service_admins_controller.rb

SELECT  `service_admins`.* FROM `service_admins`  WHERE `service_admins`.`id` = 2 LIMIT 1
SELECT  `services`.* FROM `services`  WHERE `services`.`id` = 4 LIMIT 1
---
	def home
		@service_admin = ServiceAdmin.find(session[:id])
		@service = Service.find(session[:service_id])

SELECT  `service_admins`.* FROM `service_admins`  WHERE `service_admins`.`username` = 'gohar'  ORDER BY `service_admins`.`id` ASC LIMIT 1
---
	def login
		if params[:username].present? && params[:password].present?
			found_user = ServiceAdmin.where(:username => params[:username]).first

SELECT  `service_admins`.* FROM `service_admins`  WHERE `service_admins`.`id` = 1 LIMIT 1
---
	def show
		authorized?
		@service_admin = ServiceAdmin.find(params[:id])

INSERT INTO `service_admins` (`created_at`, `password_digest`, `service_id`, `updated_at`, `username`) VALUES ('2015-04-03 22:15:47', '$2a$10$54yaDDa35aJzsgMdd5hTVut0K74bK9uPuzcJWIEpXETHvjI4H9ikq', 3, '2015-04-03 22:15:47', 'gohar')
---
	def create
		# passwords from the input form must match
		if params[:service_admin][:password] != params[:service_admin][:password_confirm]
			flash[:notice] = "Passwords don't match!"
			redirect_to(:action => 'new')
			return
		end

		@service_admin = ServiceAdmin.new(service_admin_params)
		if @service_admin.save

SELECT  `service_admins`.* FROM `service_admins`  WHERE `service_admins`.`id` = 1 LIMIT 1
UPDATE `service_admins` SET `password_digest` = '$2a$10$RFkd78ypdUDz.IS2vlpB4ur4vi99eKbqyfdTqhXKQp7nJ77ycHGPe', `updated_at` = '2015-04-04 10:46:17' WHERE `service_admins`.`id` = 1
---
	def update
		authorized?
		@service_admin = ServiceAdmin.find(params[:id])
		if @service_admin.update_attributes(service_admin_params)

SELECT  `service_admins`.* FROM `service_admins`  WHERE `service_admins`.`id` = 1 LIMIT 1
---
	def edit
		authorized?
		@service_admin = ServiceAdmin.find(params[:id])