rails/app/controllers/services_controller.rb

SELECT `services`.* FROM `services`
---
	def index
	  @services = Service.all

SELECT  `services`.* FROM `services`  WHERE `services`.`id` = 1 LIMIT 1
---
	def show
	  @service = Service.find(params[:id])

SELECT `services`.* FROM `services`  WHERE (name LIKE '%%' OR address LIKE '%%' OR city LIKE '%%' OR country LIKE '%%' OR description LIKE '%%' OR category LIKE '%%')
---
	def find
		@services = Service.search(params[:query])

INSERT INTO `services` (`address`, `category`, `city`, `country`, `created_at`, `description`, `latitude`, `longitude`, `name`, `updated_at`) VALUES ('MM Alam Road', 'fast_food', 'Lahore', 'Pakistan', '2015-04-02 22:30:24', 'Some great pizza here!', 34.0, 77.0, 'Pizza Hut', '2015-04-02 22:30:24')
---
	def create
		@service = Service.new(service_params)
		if @service.save

SELECT  `services`.* FROM `services`  WHERE `services`.`id` = 1 LIMIT 1
---
	def edit
		authorized?
		@service = Service.find(params[:id])

SELECT  `services`.* FROM `services`  WHERE `services`.`id` = 3 LIMIT 1
UPDATE `services` SET `category` = 'continental', `updated_at` = '2015-04-03 20:55:50' WHERE `services`.`id` = 3
---
	def update
		authorized?
		@service = Service.find(params[:id])
		if @service.update_attributes(service_params)

DELETE FROM `services` WHERE `services`.`id` = 3
SELECT  `services`.* FROM `services`  WHERE `services`.`id` = 3 LIMIT 1
---
	def destroy
		authorized?
		@service = Service.find(params[:id]).destroy